HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_regdef.h
/** \\brief  EMEM Service requests */
typedef volatile struct _Ifx_SRC_GEMEM
{
    Ifx_SRC_EMEM EMEM[1];                   /**< \brief 0, EMEM Service requests */
} Ifx_SRC_GEMEM;

/** \\brief  ERAY Service requests */
typedef volatile struct _Ifx_SRC_GERAY
{
    Ifx_SRC_ERAY ERAY[2];                   /**< \brief 0, ERAY Service requests */
} Ifx_SRC_GERAY;

/** \\brief  ETH Service requests */
typedef volatile struct _Ifx_SRC_GETH
{
    Ifx_SRC_ETH ETH[1];                     /**< \brief 0, ETH Service requests */
} Ifx_SRC_GETH;

/** \\brief  FCE Service requests */
typedef volatile struct _Ifx_SRC_GFCE
{
    Ifx_SRC_FCE FCE[1];                     /**< \brief 0, FCE Service requests */
} Ifx_SRC_GFCE;

/** \\brief  FFT Service requests */
typedef volatile struct _Ifx_SRC_GFFT
{
    Ifx_SRC_FFT FFT[1];                     /**< \brief 0, FFT Service requests */
} Ifx_SRC_GFFT;

/** \\brief  GPSR Service requests */
typedef volatile struct _Ifx_SRC_GGPSR
{
    Ifx_SRC_GPSR GPSR[3];                   /**< \brief 0, GPSR Service requests */
} Ifx_SRC_GGPSR;

/** \\brief  GPT12 Service requests */
typedef volatile struct _Ifx_SRC_GGPT12
{
    Ifx_SRC_GPT12 GPT12[1];                 /**< \brief 0, GPT12 Service requests */
} Ifx_SRC_GGPT12;

/** \\brief  GTM Service requests */
typedef volatile struct _Ifx_SRC_GGTM
{
    Ifx_SRC_GTM GTM[1];                     /**< \brief 0, GTM Service requests */
} Ifx_SRC_GGTM;

/** \\brief  HSCT Service requests */
typedef volatile struct _Ifx_SRC_GHSCT
{
    Ifx_SRC_HSCT HSCT[1];                   /**< \brief 0, HSCT Service requests */
} Ifx_SRC_GHSCT;

/** \\brief  HSM Service requests */
typedef volatile struct _Ifx_SRC_GHSM
{
    Ifx_SRC_HSM HSM[1];                     /**< \brief 0, HSM Service requests */
} Ifx_SRC_GHSM;

/** \\brief  HSSL Service requests */
typedef volatile struct _Ifx_SRC_GHSSL
{
    Ifx_SRC_HSSL HSSL[4];                   /**< \brief 0, HSSL Service requests */
    Ifx_SRC_SRCR EXI;                       /**< \brief 40, Exception Service Request */
} Ifx_SRC_GHSSL;

/** \\brief  I2C Service requests */
typedef volatile struct _Ifx_SRC_GI2C
{
    Ifx_SRC_I2C I2C[2];                     /**< \brief 0, I2C Service requests */
} Ifx_SRC_GI2C;

/** \\brief  LMU Service requests */
typedef volatile struct _Ifx_SRC_GLMU
{
    Ifx_SRC_LMU LMU[1];                     /**< \brief 0, LMU Service requests */
} Ifx_SRC_GLMU;

/** \\brief  MSC Service requests */
typedef volatile struct _Ifx_SRC_GMSC
{
    Ifx_SRC_MSC MSC[3];                     /**< \brief 0, MSC Service requests */
} Ifx_SRC_GMSC;

/** \\brief  PMU Service requests */
typedef volatile struct _Ifx_SRC_GPMU
{
    Ifx_SRC_PMU PMU[2];                     /**< \brief 0, PMU Service requests */
} Ifx_SRC_GPMU;

/** \\brief  PSI5 Service requests */
typedef volatile struct _Ifx_SRC_GPSI5
{
    Ifx_SRC_PSI5 PSI5[1];                   /**< \brief 0, PSI5 Service requests */
} Ifx_SRC_GPSI5;

/** \\brief  PSI5S Service requests */
typedef volatile struct _Ifx_SRC_GPSI5S
{
    Ifx_SRC_PSI5S PSI5S[1];                 /**< \brief 0, PSI5S Service requests */
} Ifx_SRC_GPSI5S;

/** \\brief  QSPI Service requests */
typedef volatile struct _Ifx_SRC_GQSPI
{
    Ifx_SRC_QSPI QSPI[6];                   /**< \brief 0, QSPI Service requests */
} Ifx_SRC_GQSPI;

/** \\brief  SCU Service requests */
typedef volatile struct _Ifx_SRC_GSCU
{
    Ifx_SRC_SCU SCU;                        /**< \brief 0, SCU Service requests */
} Ifx_SRC_GSCU;

/** \\brief  SENT Service requests */
typedef volatile struct _Ifx_SRC_GSENT
{
    Ifx_SRC_SENT SENT[1];                   /**< \brief 0, SENT Service requests */
} Ifx_SRC_GSENT;

/** \\brief  SMU Service requests */
typedef volatile struct _Ifx_SRC_GSMU
{
    Ifx_SRC_SMU SMU[1];                     /**< \brief 0, SMU Service requests */
} Ifx_SRC_GSMU;

/** \\brief  STM Service requests */
typedef volatile struct _Ifx_SRC_GSTM
{
    Ifx_SRC_STM STM[3];                     /**< \brief 0, STM Service requests */
} Ifx_SRC_GSTM;

/** \\brief  VADC Service requests */
typedef volatile struct _Ifx_SRC_GVADC
{
    Ifx_SRC_VADCG G[11];                    /**< \brief 0, VADCG Service requests */
    unsigned char reserved_B0[112];         /**< \brief B0, \internal Reserved */
    Ifx_SRC_VADCCG CG[2];                   /**< \brief 120, VADCCG Service requests */
} Ifx_SRC_GVADC;

/** \\brief  XBAR Service requests */
typedef volatile struct _Ifx_SRC_GXBAR
{
    Ifx_SRC_XBAR XBAR;                      /**< \brief 0, XBAR Service requests */
} Ifx_SRC_GXBAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Src_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  SRC object */
typedef volatile struct _Ifx_SRC
{
    Ifx_SRC_GCPU CPU;                       /**< \brief 0, CPU Service requests */
    unsigned char reserved_C[20];           /**< \brief C, \internal Reserved */
    Ifx_SRC_GEMEM EMEM;                     /**< \brief 20, EMEM Service requests */
    Ifx_SRC_GAGBT AGBT;                     /**< \brief 24, AGBT Service requests */
    unsigned char reserved_28[24];          /**< \brief 28, \internal Reserved */
    Ifx_SRC_GBCU BCU;                       /**< \brief 40, BCU Service requests */
    unsigned char reserved_44[4];           /**< \brief 44, \internal Reserved */
    Ifx_SRC_GXBAR XBAR;                     /**< \brief 48, XBAR Service requests */
    unsigned char reserved_4C[4];           /**< \brief 4C, \internal Reserved */
    Ifx_SRC_GCERBERUS CERBERUS;             /**< \brief 50, CERBERUS Service requests */
    unsigned char reserved_58[40];          /**< \brief 58, \internal Reserved */
    Ifx_SRC_GASCLIN ASCLIN;                 /**< \brief 80, ASCLIN Service requests */
    unsigned char reserved_B0[224];         /**< \brief B0, \internal Reserved */
    Ifx_SRC_GQSPI QSPI;                     /**< \brief 190, QSPI Service requests */
    unsigned char reserved_220[112];        /**< \brief 220, \internal Reserved */
    Ifx_SRC_GHSCT HSCT;                     /**< \brief 290, HSCT Service requests */
    unsigned char reserved_294[12];         /**< \brief 294, \internal Reserved */
    Ifx_SRC_GHSSL HSSL;                     /**< \brief 2A0, HSSL Service requests */
    unsigned char reserved_2E4[28];         /**< \brief 2E4, \internal Reserved */
    Ifx_SRC_GI2C I2C;                       /**< \brief 300, I2C Service requests */
    unsigned char reserved_330[32];         /**< \brief 330, \internal Reserved */
    Ifx_SRC_GSENT SENT;                     /**< \brief 350, SENT Service requests */
    unsigned char reserved_38C[84];         /**< \brief 38C, \internal Reserved */
    Ifx_SRC_GMSC MSC;                       /**< \brief 3E0, MSC Service requests */
    unsigned char reserved_41C[4];          /**< \brief 41C, \internal Reserved */
    Ifx_SRC_GCCU6 CCU6;                     /**< \brief 420, CCU6 Service requests */
    unsigned char reserved_440[32];         /**< \brief 440, \internal Reserved */
    Ifx_SRC_GGPT12 GPT12;                   /**< \brief 460, GPT12 Service requests */
    Ifx_SRC_GSTM STM;                       /**< \brief 490, STM Service requests */
    unsigned char reserved_4A8[8];          /**< \brief 4A8, \internal Reserved */
    Ifx_SRC_GFCE FCE;                       /**< \brief 4B0, FCE Service requests */
    unsigned char reserved_4B4[60];         /**< \brief 4B4, \internal Reserved */
    Ifx_SRC_GDMA DMA;                       /**< \brief 4F0, DMA Service requests */
    unsigned char reserved_700[496];        /**< \brief 700, \internal Reserved */
    Ifx_SRC_GETH ETH;                       /**< \brief 8F0, ETH Service requests */
    unsigned char reserved_8F4[12];         /**< \brief 8F4, \internal Reserved */
    Ifx_SRC_GCAN CAN;                       /**< \brief 900, CAN Service requests */
    Ifx_SRC_GCANR CANR;                     /**< \brief 940, CAN Service requests */
    unsigned char reserved_960[32];         /**< \brief 960, \internal Reserved */
    Ifx_SRC_GVADC VADC;                     /**< \brief 980, VADC Service requests */
    unsigned char reserved_AC0[144];        /**< \brief AC0, \internal Reserved */
    Ifx_SRC_GDSADC DSADC;                   /**< \brief B50, DSADC Service requests */
    unsigned char reserved_BA0[64];         /**< \brief BA0, \internal Reserved */
    Ifx_SRC_GERAY ERAY;                     /**< \brief BE0, ERAY Service requests */
    Ifx_SRC_GPMU PMU;                       /**< \brief C30, PMU Service requests */
    unsigned char reserved_C38[136];        /**< \brief C38, \internal Reserved */
    Ifx_SRC_GHSM HSM;                       /**< \brief CC0, HSM Service requests */
    unsigned char reserved_CC8[8];          /**< \brief CC8, \internal Reserved */
    Ifx_SRC_GSCU SCU;                       /**< \brief CD0, SCU Service requests */
    unsigned char reserved_CE4[44];         /**< \brief CE4, \internal Reserved */
    Ifx_SRC_GSMU SMU;                       /**< \brief D10, SMU Service requests */
    unsigned char reserved_D1C[20];         /**< \brief D1C, \internal Reserved */
    Ifx_SRC_GPSI5 PSI5;                     /**< \brief D30, PSI5 Service requests */
    unsigned char reserved_D50[32];         /**< \brief D50, \internal Reserved */
    Ifx_SRC_GDAM DAM;                       /**< \brief D70, DAM Service requests */
    unsigned char reserved_D88[24];         /**< \brief D88, \internal Reserved */
    Ifx_SRC_GCIF CIF;                       /**< \brief DA0, CIF Service requests */
    unsigned char reserved_DB0[48];         /**< \brief DB0, \internal Reserved */
    Ifx_SRC_GLMU LMU;                       /**< \brief DE0, LMU Service requests */
    unsigned char reserved_DE4[12];         /**< \brief DE4, \internal Reserved */
    Ifx_SRC_GPSI5S PSI5S;                   /**< \brief DF0, PSI5S Service requests */
    unsigned char reserved_E10[432];        /**< \brief E10, \internal Reserved */
    Ifx_SRC_GFFT FFT;                       /**< \brief FC0, FFT Service requests */
    unsigned char reserved_FCC[52];         /**< \brief FCC, \internal Reserved */
    Ifx_SRC_GGPSR GPSR;                     /**< \brief 1000, GPSR Service requests */
    unsigned char reserved_1060[1440];      /**< \brief 1060, \internal Reserved */
    Ifx_SRC_GGTM GTM;                       /**< \brief 1600, GTM Service requests */
    unsigned char reserved_1F58[168];       /**< \brief 1F58, \internal Reserved */
} Ifx_SRC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSRC_REGDEF_H */
